---
kind: other
id: Properties.T:Autodesk.Revit.DB.TransactWithCentralOptions
source: html/ea8b17cf-373b-2c87-467f-c37c00af1561.htm
---
# TransactWithCentralOptions Properties

Specifies whether the .NET object represents a valid Revit entity.